app/controllers/admin/category_controller.rb

  def index
    @categores = Category.page(params[:page]).per(8)
    # binding.irb
    @category = Category.first
---
SELECT "categories".* FROM "categories" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def edit
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]