app/views/members/ideas/_sab.html.erb

    <%= f.label :カテゴリー %>
    <%= f.select :category_id, Category.all.map { |category| [category.name, category.id] }, {}, class: 'form-control' %>
---
SELECT "categories".* FROM "categories"