app/controllers/members/comments_controller.rb

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "comments" ("idea_id", "comment_detail", "member_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["idea_id", 1], ["comment_detail", "aaaa"], ["member_id", 1], ["created_at", "2022-04-17 11:23:31.148986"], ["updated_at", "2022-04-17 11:23:31.148986"]]
---
  def create
    @idea = Idea.find(params[:idea_id])
    comment = @idea.comments.new(comment_params)
    comment.member_id = current_member.id
    if comment.save