app/controllers/members/ideas_controller.rb

SELECT "ideas".* FROM "ideas" WHERE "ideas"."member_id" = ?  [["member_id", 1]]
---
  def index
    @my_ideas = Idea.all

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # @my_ideas = current_member.ideas
    @comment = Comment
    @idea = Idea.find(params[:id])
    @member = Member.find(@idea.member_id)

INSERT INTO "ideas" ("category_id", "member_id", "title", "idea_detail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "ideas".* FROM "ideas"
---
  def create
    @idea =Idea.new(idea_params)
    @idea.member_id = current_member.id
    if @idea.save!
      redirect_to members_ideas_path, notice: "You have created book successfully."
    else
      @ideas = Idea.all