app/controllers/members/member_controller.rb

SELECT "members".* FROM "members"
---
  def index
    @members = Member.all

SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @idea = Idea.find(params[:id])

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @member = Member.find(params[:id])

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "members" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["name", "nameA"], ["introduction", "投稿内容　A\r\n"], ["updated_at", "2022-04-17 09:37:49.732340"], ["id", 1]]
---
  def update
   @member = Member.find(params[:id])
    if @member.update(member_params)