app/controllers/members/member_controller.rb

  def show
    # @idea = Idea.find(params[:id])
    @member = Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? ORDER BY "members"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def set_member
     @member = Member.find_by(:id => params[:id])
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? ORDER BY "members"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]